/*-------------------------------------------------------------------------
*@Author		Zwxf
*@Email			Zwxf.cw@gmail.com
/*
 * Copyright(c) 2016-2100.  zwxf.  All rights reserved.
 */
/*
 * FileName:      app_config.c
 * Author:        zwxf
 * Email:         zhiwei1007@qq.com
 * DateTime:      2017-05-27 09:06:03
 * ModifiedTime:  2017-05-27 09:06:03
 */
#include <common.h>
#if defined(CONFIG_FREERTOS)
#include <FreeRTOS.h>
#include <task.h>
#include <gpio.h>
#endif
//#include <string.h>
#include <cfg_api.h>
#include <log/log.h>
#include <app_config.h>
#include <event_process.h>
#include <cJSON.h>
#include <wifi_clock_cfg.h>
extern sdk_param sdkParam;
#if 1
const char* cityTable [2475] = {
"北京","朝阳","顺义","怀柔","通州","昌平","延庆","丰台","石景山",
"大兴","房山","密云","门头沟","平谷","海淀","天津","宝坻","东丽","西青","北辰","蓟县",
"静海","津南","滨海新区","武清","宁河","上海","宝山","嘉定","浦东新区","青浦","松江",
"奉贤","崇明","徐汇","闵行","金山","石家庄","张家口","承德","唐山","秦皇岛","沧州",
"衡水","邢台","邯郸","保定","廊坊","郑州","新乡","许昌","平顶山","信阳","南阳","开封",
"洛阳","商丘","焦作","鹤壁","濮阳","周口","漯河","驻马店","三门峡","济源","安阳","合肥",
"芜湖","淮南","马鞍山","安庆","宿州","阜阳","亳州","黄山","滁州","淮北","铜陵","宣城",
"六安","池州","蚌埠","杭州","舟山","湖州","嘉兴","金华","绍兴","台州","温州","丽水","衢州",
"宁波","重庆","合川","南川","江津","渝北","北碚","巴南","长寿","黔江","万州","涪陵","开县",
"城口","云阳","巫溪","奉节","巫山","潼南","垫江","梁平","忠县","石柱","大足","荣昌","铜梁",
"璧山","丰都","武隆","彭水","綦江","酉阳","秀山","永川","福州","泉州","漳州","龙岩","晋江",
"南平","厦门","宁德","莆田","三明","兰州","平凉","庆阳","武威","金昌","嘉峪关","酒泉",
"天水","武都","临夏","合作","白银","定西","张掖","广州","惠州","梅州","汕头","深圳","珠海",
"佛山","肇庆","湛江","江门","河源","清远","云浮","潮州","东莞","中山","阳江","揭阳","茂名",
"汕尾","韶关","南宁","柳州","来宾","桂林","梧州","防城港","贵港","玉林","百色","钦州",
"河池","北海","崇左","贺州","贵阳","安顺","都匀","铜仁","毕节","六盘水","遵义","凯里",
"昆明","红河","文山","玉溪","楚雄","普洱","昭通","临沧","怒江","香格里拉","丽江","德宏",
"景洪","大理","曲靖","保山","呼和浩特","乌海","集宁","通辽","阿拉善左旗","鄂尔多斯",
"临河","锡林","乌兰","包头","赤峰","南昌","上饶","抚州","宜春","鹰潭","赣州",
"景德镇","萍乡","新余","九江","吉安","武汉","黄冈","荆州","宜昌","恩施","十堰","神农架",
"随州","荆门","天门","仙桃","潜江","襄阳","鄂州","孝感","黄石","咸宁","成都","自贡","绵阳",
"南充","达州","遂宁","广安","巴中","泸州","宜宾","内江","资阳","乐山","眉山","凉山","雅安",
"甘孜","阿坝","德阳","广元","攀枝花","银川","中卫","固原","石嘴山","吴忠","西宁","黄南",
"海北","果洛","玉树","海西","海东","海南","济南","潍坊","临沂","菏泽","滨州","东营","威海",
"枣庄","日照","莱芜","聊城","青岛","淄博","德州","烟台","济宁","泰安","西安","延安","榆林",
"铜川","商洛","安康","汉中","宝鸡","咸阳","渭南","太原","临汾","运城","朔州","忻州","长治",
"大同","阳泉","晋中","晋城","吕梁","乌鲁木齐","石河子","昌吉","吐鲁番","库尔勒","阿拉尔",
"阿克苏","喀什","伊宁","塔城","哈密","和田","阿勒泰","阿图什","博乐","克拉玛依","拉萨",
"山南","阿里","昌都","那曲","日喀则","林芝","台北县","高雄","台中","海口","三亚","东方",
"临高","澄迈","儋州","昌江","白沙","琼中","定安","屯昌","琼海","文昌","保亭","万宁","陵水",
"乐东","五指山","长沙","株洲","衡阳","郴州","常德","益阳","娄底","邵阳","岳阳","张家界",
"怀化","永州","吉首","湘潭","南京","镇江","苏州","南通","扬州","宿迁","徐州","淮安",
"连云港","常州","泰州","无锡","盐城","哈尔滨","牡丹江","佳木斯","绥化","黑河","双鸭山",
"伊春","大庆","七台河","鸡西","鹤岗","齐齐哈尔","大兴安岭","长春","延吉","四平","白山",
"白城","辽源","松原","吉林","通化","沈阳","鞍山","抚顺","本溪","丹东","葫芦岛","营口",
"阜新","辽阳","铁岭","朝阳","盘锦","大连","锦州","阿城","安达","安定","阿尔山","安福",
"安国","敖汉旗","阿合奇","安化","安吉","阿荣旗","阿克陶","安龙","阿拉善右旗","安陆","安宁",
"安平","安丘","安仁","安塞","安图","阿瓦提","安新","安溪","安乡","安县","安义","安远",
"安岳","安泽","博爱","北安","博白","宾川","拜城","巴楚","保德","巴东","布尔津","宝丰",
"班戈","普格","滨海","白河","博湖","保靖","保康","勃利","北流","木里","巴里坤","巴林左旗",
"巴林右旗","博罗","巴马","班玛","北票","宝清","拜泉","白水","泊头","布拖","宾县","博兴",
"彬县","宝兴","本溪县","巴彦","泌阳","白云鄂博","宝应","霸州","淳安","长安","错那",
"察布查尔","赤壁","陈巴尔虎旗","城步","赤城","澄城","长岛","蔡甸","长丰","长葛","岑巩",
"呈贡","城固","长海","册亨","察哈尔右翼前旗","察哈尔右翼中旗","察哈尔右翼后旗","从化",
"淳化","从江","澄江","昌乐","长乐","策勒","长岭","昌黎","崇礼","茶陵","慈利","长白",
"苍南","常宁","长宁","昌宁","遂平","长清","崇仁","临沂兰陵","常熟","常山","赤水","长顺",
"长泰","长汀","昌图","成武","苍梧","长武","曹县","长兴","慈溪","辰溪","岑溪","崇信","成县",
"苍溪","崇阳","长阳","潮阳","昌邑","崇义","长垣","沧源","崇州","长子","大安","德安","东安",
"都安","电白","德保","定边","迭部","大柴旦","都昌","郸城","东川","大城","大厂","德昌",
"杜尔伯特","大方","东丰","大丰","登封","丹凤","东港","东光","大关","东海",
"澄海","德惠","敦化","德化","敦煌","德江","丹江口","都江堰","磴口","洞口","东兰","海西冷湖",
"大荔","丹棱","鄂尔多斯达拉特","多伦","斗门","东明","定南","东宁","大宁","东平","大埔",
"德清","德庆","丁青","德钦","达日","定日","东胜","砀山","岱山","东山","独山","大石桥",
"灯塔","定陶","东台","大田","洞头","大通","当涂","大洼","锡林郭勒东乌旗","大悟","定襄",
"代县","德兴","东乡","道县","大新","丹阳","东阳","当阳","大姚","大冶","大邑","定远","大余",
"定州","东至","邓州","大竹","道真","丹寨","峨边","阿拉善盟额济纳","二连浩特","额敏",
"峨眉山","恩平","峨山","鄂尔多斯鄂托克","鄂尔多斯鄂前旗","洱源","福安","凤城","肥城","繁昌",
"丰城","方城","富川","福鼎","肥东","扶风","佛冈","凤冈","扶沟","福贡","府谷","福海","奉化",
"凤凰","富锦","封开","阜康","法库","富民","丰南","阜南","阜宁","富宁","丰宁","阜平","富平",
"佛坪","福清","封丘","凤庆","福泉","丰润","抚远","浮山","方山","丰顺","凤山","富顺","扶绥",
"凤台","肥乡","汾西","费县","丰县","肥西","奉新","范县","房县","富县","凤县","凤翔","汾阳",
"凤阳","富阳","分宜","富裕","扶余","番禺","富源","富蕴","方正","繁峙","丰镇","高安","公安",
"固安","高碑店","藁城","高淳","谷城","恭城","刚察","广德","广昌","贵德","甘德","贵定","桂东",
"广丰","甘谷","广汉","根河","广河","个旧","昭觉","皋兰","庄浪","古浪","广灵","古蔺","关岭",
"高陵","巩留","甘洛","耿马","高密","灌南","广南","贵南","广宁","广平","高平","桂平","高青",
"甘泉","广饶","广水","固始","光山","贡山","馆陶","高台","古田","古县","贵溪","高县","珙县",
"乾县","高阳","固阳","涡阳","桂阳","高要","灌阳","高邑","巩义","高邮","沽源","赣榆","灌云",
"光泽","改则","盖州","固镇","古丈","高州","瓜州","公主岭","怀安","海安","华安","红安",
"和布克赛尔","哈巴河","淮滨","桦川","珲春","海城","会昌","汉川","韩城","华池","霍城",
"潢川","化德","桦甸","衡东","惠东","会东","花都","横峰","鹤峰","海丰","壶关","花垣","黄骅",
"洪湖","河间","河津","获嘉","怀集","环江","合江","和静","杭锦后旗","湖口","河口","呼兰",
"怀来","惠来","贺兰","海拉尔","呼和浩特和林","虎林","海林","黄陵","会理","和龙","黄龙",
"化隆","海伦","呼玛","海门","黄梅","桦南","辉南","衡南","河南","怀宁","海宁","华宁","会宁",
"惠农","和平","黄平","华坪","黄陂","合浦","霍邱","鹤庆","河曲","桓仁","怀仁","华容","黑山",
"和顺","霍山","衡山","汉寿","鹤山","惠水","横山","合水","和硕","桓台","呼图壁","华亭","洪洞",
"会同","滑县","辉县","横县","户县","华县","环县","徽县","海阳","海盐","黄岩","淮阳","惠阳",
"合阳","洪雅","华阴","汉阴","浑源","怀远","湟源","海原","汉源","洪泽","会泽","霍州","化州",
"赫章","和政","集安","靖安","江安","靖边","吉木乃","建昌","鄄城","剑川","江川","江城","泾川",
"旌德","建德","鸡东","景东","江都","剑阁","井冈山","景谷","交城","蛟河","嘉禾","剑河","精河",
"建湖","金湖","江华","井陉","靖江","椒江","夹江","交口","江口","将乐",
"监利","江陵","蕉岭","嘉黎","吉木萨尔","即墨","青岛黄岛","莒南","江宁",
"景宁","建宁","晋宁","静宁","建瓯","锦屏","金平","句容","稷山","界首",
"江山","嘉善","吉水","建始","京山","金沙","建水","伽师","九台","金坛",
"金堂","金塔","景泰","犍为","集贤","介休","吉县","金乡","嘉祥","莒县",
"绩溪","泾县","进贤","金溪","郏县","浚县","江夏","揭西","金秀","靖西",
"佳县","济阳","姜堰","建阳","泾阳","井研","金阳","巨野","嘉荫","江阴",
"江永","江油","靖宇","缙云","嘉鱼","靖远","泾源","晋州","胶州","金寨",
"靖州","尖扎","久治","康保","库车","宽城","宽甸","康定","克东",
"通辽科左中旗","通辽科左后旗","开化","开江","岢岚","康乐","通辽库伦",
"喀喇沁旗","开鲁","康平","开平","柯坪","克山","昆山","克什克腾旗","康县",
"开原","开远","来安","临安","隆安","留坝","灵宝","萝北","荔波","雷波",
"澜沧","栾城","黎城","潞城","陵川","凉城","连城","黎川","栾川","利川",
"乐昌","龙川","柳城","灵川","陆川","罗城","隆昌","陇川","绿春","洛川",
"两当","隆德","林甸","罗定","罗甸","鲁甸","蓝田","乐都","娄烦","来凤",
"陆丰","禄丰","岚皋","临桂","凌海","临海","龙海","柳河","六合","梁河",
"老河口","隆化","莲花","隆回","龙江","龙井","临江","利津","连江","廉江",
"柳江","兰考","林口","龙口","浪卡子","柳林","乐陵","醴陵","临澧","隆林",
"龙里","陆良","龙陵","洛隆","龙门","龙南","连南","洛南","滦南","洛宁",
"乐平","连平","黎平","罗平","兰坪","荔浦","洛浦","临清","乐清","临朐",
"临泉","龙泉","礼泉","碌曲","灵寿","灵石","离石","梁山","临沭","溧水",
"涟水","庐山","鲁山","罗山","龙山","蓝山","连山","龙胜","灵山","邻水",
"雷山","卢氏","芦山","泸水","冷水江","临洮","灵台","临潭","轮台","罗田",
"乐亭","临潼","临武","灵武","兰西","蠡县","临县","岚县","林西","莱西",
"郎溪","利辛","兰溪","临湘","澧县","泸溪","芒市","泸西","陇县","陇西",
"礼县","理县","禄劝","莱阳","溧阳","耒阳","浏阳","开阳","略阳","乐业",
"临猗","鹿邑","临颍","龙游","麟游","凌源","涞源","罗源","涟源","凌云",
"盐源","临泽","辽中","莱州","连州","龙州","鹿寨","乐至","六枝","雷州",
"拉孜","隆子","临淄","马边","满城","蒙城","麻城","渑池","沐川","牟定",
"弥渡","玛多","马尔康","民丰","麦盖提","明光","马关","美姑","勐海",
"民和","漠河","梅河口","麻江","墨江","芒康","木兰","勐腊","弥勒","民乐",
"木垒","穆棱","孟连","平湖","马龙","麻栗坡","莫力达瓦旗","汨罗","冕宁",
"玛纳斯","牟平","闽清","民勤","民权","玛曲","密山","明水","马山","蒙山",
"名山","湄潭","明溪","勉县","眉县","岷县","茂县","麻阳","茫崖","蒙阴",
"米易","门源","墨玉","米脂","绵竹","蒙自","满洲里","宁安","农安","南安",
"南澳","那坡","南部","宁城","南城","南丹","宁都","南丰","南宫","宁国",
"宁海","南海","讷河","宁化","内黄","南华","嫩江","宁津","南靖","南江","南涧","南康","宁蒗","南乐","南陵","宁陵","尼勒克","聂拉木","宁明","南木林","奈曼旗","尼木","宁南","宁强","宁陕","宁武","内乡","宁乡","南县","南雄","纳溪","南溪","宁县","宁阳","纳雍","宁远","南召","南漳","南郑","磐安","蓬安","普安","平坝","浦北","屏边","浦城","平昌","蒲城","平定","普定","平度","偏关","平果","平和","浦江","平江","蒲江","蓬莱","普兰","普兰店","平乐","平利","平陆","平罗","屏南","平南","普宁","平泉","磐石","盘山","平山","平顺","屏山","皮山","彭山","平潭","平塘","普陀","平武","蒲县","沛县","凭祥","郫县","蓬溪","盘县","平遥","平阳","宾阳","彭阳","平阴","平邑","平原","平远","平舆","彭泽","邳州","彭州","庆安","乾安","秦安","迁安","丘北","蕲春","青川","启东","祁东","清丰","曲阜",
"青冈","青河","全椒","曲江","巧家","清涧","邛崃","祁连","清流","晴隆","祁门","曲麻莱",
"且末","全南","沁水","潜山","铅山","岐山","清水","确山","青神","奇台","青田","青铜峡",
"曲沃","迁西","青县","祁县","沁县","栖霞","杞县","淇县","渠县","清徐","曲阳","青阳","沁阳",
"祁阳","千阳","清原","清苑","沁源","庆云","庆元","曲周","青州","全州","清镇","瑞安","融安",
"容城","瑞昌","汝城","如东","如皋","仁化","仁怀","瑞金","榕江","瑞丽","汝南","滦平","饶平",
"任丘","若羌","融水","仁寿","滦县","芮城","容县","荣县","汝阳","乳源","汝州","双柏","肃北",
"绥滨","施秉","上蔡","双城","神池","舒城","遂昌","顺昌","沙县","遂川","石城","莎车","商城",
"山丹","顺德","绥德","施甸","邵东","商都","三都","什邡","双峰","绥芬河","上高","寿光",
"上杭","三河","沙河","商河","泗洪","射洪","四会","三穗","三江","绥江","双江","舒兰","绥棱",
"双辽","上林","双流","石林","石楼","三门","石门","嵩明","石棉","神木","思南","商南","肃南",
"睢宁","寿宁","绥宁","苏尼特左旗","苏尼特右旗","双牌","松潘","顺平","石屏","社旗","石阡",
"沈丘","石泉","泗水","商水","石首","韶山","三水","鄯善","嵊泗","上思","宿松","石台","三台",
"松桃","沙湾","孙吴","邵武","涉县","单县","濉溪","歙县","泗县","松溪","睢县","嵩县","始兴",
"遂溪","双阳","寿阳","射阳","泗阳","松阳","绥阳","山阳","沙雅","尚义","山阴","上犹","上虞",
"三原","深泽","尚志","绥中","桑植","松滋","师宗","四子王旗","台安","同安","桐柏","太白",
"太仓","郯城","桐城","天长","柘城","通城","腾冲","通道","天等","同德","田东","天峨","太谷",
"铜鼓","潼关","通海","唐海","塔河","通河","太和","泰和","唐河","太湖","通化县","同江","桃江",
"通江","台江","天峻","太康","特克斯","托克托","托克逊","泰来","铁力","屯留","田林","托里",
"桐庐","图们","土默特左旗","土默特右旗","洮南","泰宁","太仆寺旗","台前","突泉","天全","柘荣",
"塔什库尔干","泰顺","通山","台山","天台","通渭","唐县","泰兴","桐乡","藤县","同心","通许",
"田阳","汤阴","汤原","通榆","桃源","天镇","滕州","天柱","天祝","桐梓","武安","万安","文安",
"舞阳","吴堡","旺苍","五常","围场","武川","武城","文成","吴川","务川","汶川","五大连池",
"无棣","武定","望都","瓦房店","五峰","舞钢","武冈","武功","五河","卫辉","五华","无极","吴江",
"望江","孟津","温江","望奎","乌兰","温岭","尉犁","乌拉特前旗","乌拉特中旗","乌拉特后旗",
"惠民","武鸣","望谟","武宁","万年","威宁","翁牛特旗","武平","汪清","吴桥","乌恰","万全",
"温泉","万荣","文水","微山","汶上","尉氏","武胜","万山","巍山","武山","乌什","乌苏","温宿",
"蔚县","武乡","温县","威信","文县","维西","武穴","武宣","武义","五营","乌伊岭","武夷山",
"五原","婺源","翁源","万源","渭源","威远","万载","五寨","武陟","互助","新安","新巴尔虎左旗",
"新巴尔","新蔡","兴城","新昌","襄城","淅川","忻城","西昌","西充","西畴","项城","喜德",
"寻甸","新都","宣恩","西丰","襄汾","信丰","咸丰","新丰","息烽","新干","兴国","宣汉","兴海",
"兴和","西和","夏河","新和","香河","镶黄旗","宣化","兴化","新化","新晃","新会","循化","西华",
"辛集","新绛","夏津","新建","峡江","新津","西吉","小金","仙居","逊克","新乐","西林","兴隆",
"西盟","新民","新密","乡宁","休宁","新宁","兴宁","新平","兴平","西平","霞浦","溆浦","兴仁",
"徐水","响水","萧山","修水","浠水","兴山","新邵","习水","行唐","新泰","新田","徐闻","兴文",
"修文","宣威","西乌珠","寻乌","修武","雄县","隰县","兴县","萧县","西峡","湘乡","新兴",
"西乡","息县","新县","攸县","昔阳","荥阳","旬阳","新野","孝义","新沂","夏邑","湘阴","信宜",
"旬邑","仙游","叙永","襄垣","祥云","新源","新郑","新洲","象州","星子","依安","永安","远安",
"姚安","盐边","漾濞","阳城","翼城","郓城","禹城","永春","永城","虞城","伊川","应城","宜城",
"阳春","岳池","延长","延川","宜川","永昌","盐池","叶城","榆次","英德","永登","永德","永定",
"于都","宜丰","永丰","永福","余干","余杭","饶河","永和","云和","沿河","玉环","宜黄","永吉",
"永嘉","余江","延津","沅江","印江","盈江","盐津","元江","永靖","永济","伊金霍洛旗","英吉沙",
"宜君","永康","牙克石","依兰","鄢陵","炎陵","沅陵","筠连","彝良","宜良","仪陇","云梦","易门",
"玉门","裕民","元谋","沂南","郁南","永年","邕宁","永宁","岳普湖","原平","玉屏","永平","余庆",
"焉耆","永清","阳曲","垣曲","永仁","延寿","榆树","元氏","榆社","沂水","颍上","玉山","偃师",
"英山","永顺","阳山","阳朔","营山","永善","砚山","永寿","永胜","鱼台","盱眙","永泰","盐亭",
"于田","玉田","义乌","伊吾","义县","易县","应县","阳信","宜兴","黟县","岳西","云霄","尤溪","永新","永修","叶县",
"阳新","郧西","郧县","永兴","越西","洋县","岫岩","余姚","弋阳","原阳","宜阳",
"元阳","阳原","右玉","沂源","兖州","扬中","仪征","禹州","宜章","宜州","榆中",
"诏安","正安","镇安","镇巴","张北","邹城","诸城","增城","子长","正定","肇东",
"治多","杂多","贞丰","左贡","准格尔旗","秭归","镇海","庄河","政和","遵化","赞皇",
"沾化","张家川","诸暨","枝江","芷江","紫金","织金","中江","张家港","镇康","泽库",
"镇赉","扎鲁","扎赉","扎兰屯","涿鹿","中牟","周宁","镇宁","正宁","卓尼",
"中宁","邹平","漳平","镇平","昭平","镇坪","漳浦","泽普","章丘","左权","舟曲","樟树",
"竹山","钟山","柞水","昭苏","梓潼","彰武","赵县","资溪","竹溪","钟祥","资兴","镇雄",
"漳县","正镶","中阳","枞阳","枣阳","紫阳","正阳","沾益","肇源","左云","招远","资源",
"镇远","紫云","镇原","镇沅","肇州","涿州","子洲","周至","资中","卓资","灵璧",
"深州","奎屯","甘南","友谊","梨树","伊通","东辽","前郭",
"抚松","江源","金州","旅顺","新宾","北镇","辽阳县","弓长岭","调兵山","喀左","建平县",
"清水河","呼市郊区","达茂旗","阿鲁旗","杭锦旗","乌审旗","阿巴嘎","正蓝旗","鄂伦春旗",
"鄂温克旗","额尔古纳","科右中旗","科右前旗","鹿泉","涞水","定兴","博野","承德县","海兴",
"盐山","肃宁","南皮","献县","孟村","沧县","枣强","武邑","武强","饶阳","故城","景县","阜城",
"冀州","临城","内丘","柏乡","隆尧","南和","宁晋","巨鹿","新河","广宗","平乡","威县","清河",
"临西","任县","峰峰","临漳","成安","大名","磁县","邱县","鸡泽","魏县","青龙","抚宁","卢龙",
"北戴河","古交","尖草坪区","小店区","阳高","大同县","灵丘","盂县","泽州","侯马","绛县",
"闻喜","夏县","平鲁","五台县","静乐","志丹","吴起","榆阳","商州","陈仓","耀州","杨凌",
"崂山","淄川","博山","周村","临邑","齐河","福山","垦利","文登","荣成","乳山","薛城",
"峄城","台儿庄","五莲","冠县","阳谷","高唐","茌平","东阿","莘县","达坂城","乌尔禾",
"白碱滩","疏附","疏勒","伊宁县","霍尔果斯","阿拉山口","当雄","林周","堆龙德庆",
"曲水","达孜","墨竹工卡","江孜","仲巴","萨嘎","吉隆","昂仁","定结","萨迦","谢通门",
"岗巴","白朗","亚东","康马","仁布","贡嘎","札囊","加查","乃东","桑日","洛扎","措美",
"琼结","曲松","波密","米林","察隅","工布江达","朗县","墨脱","边坝","类乌齐","八宿",
"江达","察雅","贡觉","尼玛","安多","索县","聂荣","巴青","比如","双湖","札达","噶尔",
"日土","革吉","措勤","湟中","称多","囊谦","崆峒","庆城","阿克塞","麦积","宕昌","东乡",
"积石山","平川","上街","林州","石龙","吉利","孟州","义马","陕县","浦口","锡山","丹徒",
"吴中","通州","邗江","盐都","铜山","淮阴区","淮安区","武进","沭阳","宿豫","东西湖","襄州",
"梁子湖","孝昌","团风","铁山","下陆","西塞山","宜都","夷陵","茅箭","张湾","掇刀","沙洋",
"象山","北仑","鄞州","嵊州","柯桥","路桥","衢江","定海","巢湖","庐江","芜湖县","无为","潘集",
"含山","和县","黄山区","屯溪","九华山","闽侯","涵江","秀屿","荔城","城厢","惠安","石狮",
"钓鱼岛","南昌县","鄱阳","上饶县","乐安","吉安县","赣县","浮梁","上栗","安源","芦溪","湘东",
"湘江新区","望城","衡阳县","南岳","苏仙","津市","赫山区","邵阳县","武陵源","中方","洪江",
"冷水滩","白云","花溪","乌当","云岩","南明","遵义县","汇川","红花岗","瓮安","黔西","兴义",
"龙泉驿","青白江","仁和","北川","阆中","通川","达川","华蓥","泸县","宜宾县","东兴","荥经",
"泸定","丹巴","九龙","雅江","道孚","炉霍","新龙","德格","白玉","石渠","色达","理塘","巴塘",
"乡城","稻城","得荣","九寨沟","金川","黑水","壤塘","若尔盖","红原","罗江","浈江","武江",
"梅县","金湾","高明","赤坎","坡头","霞山","麻章","蓬江","江海","东源","清新","云安","潮安",
"阳东","阳西","揭东","陆河","云龙","河口","宁洱","水富","云县","合山","兴安","兴业","大化",
"东兴","防城","香港","九龙","新界","澳门","氹仔岛","路环岛","桃园","新竹","宜兰","嘉义",
"台南","台东","屏东","苗栗","彰化","南投","花莲","云林","寿县"};
const unsigned int cityIdTable[2475] = 
{1,2,3,4,5,6,7,8,9,10,11,12,13,14,22,23,24,25,26,27,28,30,31,32,34,35,36,37,38,40,
41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,
68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,92,93,94,95,96,
97,98,99,100,101,102,103,104,105,106,107,108,110,111,112,113,114,116,117,118,119,120,
121,122,123,124,125,126,127,128,129,130,131,132,133,134,135,136,137,138,140,141,142,
143,144,145,146,147,148,149,150,151,152,153,154,155,156,157,158,159,160,161,162,163,
164,165,166,167,168,169,170,171,172,173,174,175,176,177,178,179,180,181,182,183,184,
185,186,187,188,189,190,191,192,193,194,195,196,197,198,199,200,201,202,204,205,206,
207,208,209,210,211,212,213,214,215,216,217,218,219,220,221,222,223,224,225,226,227,
228,229,230,231,232,234,235,236,237,238,239,240,241,242,243,244,245,246,247,248,249,
250,251,252,253,254,255,256,257,258,259,260,261,262,263,264,265,266,267,268,269,270,
271,272,273,274,275,276,277,278,279,280,281,282,283,284,285,286,287,288,289,290,291,
292,293,294,295,296,297,298,299,300,301,302,303,304,305,306,307,308,309,310,311,312,
313,314,315,316,317,318,319,320,321,322,323,324,325,326,327,328,329,330,331,332,333,
334,335,336,337,338,339,340,341,342,343,344,345,346,347,348,349,350,351,352,353,354,
355,356,357,358,359,360,361,362,363,364,365,366,367,368,369,370,371,372,373,374,375,
376,377,378,381,382,384,385,386,387,388,389,390,391,392,393,394,396,397,398,399,400,
401,402,403,404,405,406,407,408,409,410,411,412,413,414,415,416,417,418,419,420,421,
422,423,424,425,426,427,428,429,430,431,432,433,434,435,436,437,438,439,440,441,442,
443,444,445,446,447,448,449,450,452,453,454,455,456,457,458,459,460,461,462,463,464,
465,466,467,468,469,470,471,472,473,474,475,476,477,478,479,480,481,482,483,484,485,
486,487,488,489,490,491,492,494,495,496,498,499,500,501,502,503,504,505,506,508,509,
510,511,512,513,514,515,516,517,518,519,520,521,522,523,524,525,526,527,528,529,530,
531,532,534,535,536,537,538,539,540,541,542,543,544,545,546,547,548,549,550,551,552,
553,554,555,556,557,558,559,561,562,563,564,566,567,568,569,570,571,572,573,574,576,
577,578,579,580,581,582,583,584,585,586,587,588,589,590,591,592,593,594,595,596,597,
598,599,600,601,602,603,604,605,606,607,608,609,610,611,612,613,614,615,616,617,618,
619,620,621,622,623,624,625,626,627,628,629,630,631,632,634,635,636,637,638,639,640,
641,642,643,644,645,646,647,648,649,650,651,652,653,655,656,657,658,659,660,661,662,
663,664,665,666,668,669,670,671,672,673,674,675,678,679,680,681,682,683,684,685,686,
687,688,689,690,691,692,693,694,695,696,697,698,699,700,701,702,703,704,705,706,707,
708,709,710,711,712,713,714,715,716,717,718,719,720,721,722,723,724,725,726,727,728,
729,730,731,732,733,734,735,736,737,738,739,740,741,742,743,744,745,746,747,748,749,
750,751,752,753,754,755,756,757,758,759,760,761,762,763,764,765,766,767,768,770,771,
772,773,774,775,776,777,778,779,780,781,782,783,784,785,786,787,788,789,791,792,793,
794,795,796,797,798,799,800,801,802,803,804,805,806,807,808,809,810,811,812,813,814,
815,816,817,818,819,820,821,822,823,824,825,826,827,828,829,830,831,832,833,834,835,
836,837,838,839,840,841,842,843,845,846,847,848,849,850,851,852,853,854,855,856,857,
858,859,860,861,862,863,864,865,866,867,868,869,870,871,872,873,874,875,876,877,878,
880,881,882,883,884,885,886,887,888,889,890,891,892,893,894,895,896,898,899,900,901,
902,903,904,905,906,907,908,909,910,911,912,913,914,915,916,917,918,919,920,921,922,
923,924,925,926,928,929,930,931,932,933,934,935,936,937,938,939,940,942,943,944,945,
946,947,948,949,950,951,952,953,954,956,958,959,960,961,962,963,964,965,966,967,968,
969,970,972,973,974,975,976,977,978,979,980,981,982,983,984,985,986,987,988,990,991,
992,993,994,995,996,997,998,999,1000,1001,1002,1003,1004,1005,1006,1007,1008,1009,1010,
1011,1012,1013,1014,1015,1016,1017,1018,1019,1020,1021,1022,1024,1025,1026,1027,1028,
1029,1030,1031,1032,1033,1034,1035,1036,1037,1038,1039,1040,1041,1042,1043,1044,1045,
1046,1047,1048,1049,1050,1051,1052,1053,1054,1055,1056,1057,1058,1059,1060,1062,1063,
1064,1065,1066,1067,1068,1069,1070,1071,1072,1073,1074,1075,1076,1077,1078,1079,1080,
1081,1082,1083,1084,1085,1086,1087,1088,1089,1090,1091,1092,1093,1094,1095,1096,1097,
1098,1099,1100,1101,1102,1103,1104,1105,1106,1107,1108,1109,1110,1111,1112,1113,1114,
1115,1116,1117,1118,1119,1120,1121,1122,1123,1124,1125,1126,1127,1128,1129,1130,1131,
1132,1133,1134,1135,1136,1137,1138,1139,1140,1141,1142,1143,1144,1145,1146,1147,1148,
1149,1150,1151,1152,1153,1154,1155,1156,1158,1159,1160,1161,1163,1164,1165,1166,1167,
1168,1170,1171,1172,1173,1174,1175,1176,1177,1178,1179,1180,1181,1182,1183,1184,1185,
1186,1187,1188,1189,1190,1191,1192,1193,1194,1195,1196,1197,1198,1199,1200,1201,1202,
1203,1204,1205,1206,1207,1208,1209,1210,1211,1212,1213,1214,1215,1216,1217,1218,1219,
1220,1222,1223,1224,1225,1226,1227,1228,1229,1230,1231,1232,1233,1234,1235,1236,1238,
1239,1240,1242,1243,1244,1245,1246,1247,1248,1249,1250,1251,1252,1253,1254,1255,1256,
1257,1258,1259,1260,1261,1262,1263,1264,1265,1266,1267,1268,1269,1270,1271,1272,1273,
1274,1275,1276,1277,1278,1279,1280,1281,1282,1283,1284,1285,1286,1287,1288,1289,1290,
1291,1292,1293,1294,1295,1296,1297,1298,1299,1300,1301,1302,1303,1304,1305,1306,1307,
1308,1309,1310,1311,1312,1315,1316,1317,1318,1319,1320,1321,1322,1324,1325,1327,1328,
1329,1330,1331,1332,1333,1334,1335,1336,1337,1338,1339,1340,1341,1342,1343,1344,1345,
1346,1347,1348,1349,1350,1351,1352,1353,1354,1355,1356,1357,1358,1360,1361,1362,1363,
1364,1365,1366,1367,1368,1369,1370,1371,1372,1373,1374,1375,1376,1377,1378,1379,1380,
1381,1382,1383,1384,1386,1387,1388,1389,1390,1391,1392,1393,1394,1395,1396,1397,1398,
1399,1400,1401,1402,1403,1404,1406,1407,1408,1409,1410,1411,1412,1413,1414,1415,1416,
1417,1418,1419,1420,1421,1422,1423,1424,1425,1426,1427,1428,1429,1430,1431,1432,1433,
1434,1435,1436,1437,1438,1440,1441,1442,1443,1444,1445,1446,1447,1448,1449,1450,1451,
1453,1454,1455,1456,1457,1458,1459,1460,1461,1462,1463,1464,1465,1466,1467,1468,1469,
1470,1471,1472,1473,1474,1475,1476,1477,1478,1479,1480,1481,1482,1483,1484,1485,1486,
1487,1488,1490,1491,1492,1493,1494,1495,1496,1497,1498,1499,1500,1501,1502,1503,1504,
1506,1507,1508,1509,1510,1511,1512,1514,1515,1516,1517,1518,1519,1520,1521,1522,1523,
1524,1525,1526,1527,1528,1529,1530,1531,1532,1533,1534,1535,1536,1537,1538,1539,1540,
1541,1542,1543,1544,1545,1546,1547,1548,1549,1550,1551,1552,1553,1554,1555,1556,1557,
1558,1559,1560,1561,1563,1564,1565,1566,1567,1568,1569,1570,1571,1572,1573,1574,1575,
1576,1577,1578,1579,1580,1581,1582,1583,1584,1585,1586,1587,1588,1589,1590,1591,1592,
1593,1594,1595,1596,1597,1598,1599,1600,1601,1602,1603,1604,1605,1606,1607,1608,1609,
1610,1611,1613,1614,1615,1616,1617,1618,1619,1620,1621,1622,1623,1624,1625,1626,1627,
1628,1629,1630,1631,1632,1633,1634,1635,1637,1638,1639,1640,1641,1642,1643,1644,1645,
1646,1647,1648,1649,1650,1651,1652,1653,1654,1655,1656,1658,1660,1661,1662,1663,1664,
1665,1666,1667,1668,1669,1670,1671,1672,1673,1674,1675,1676,1677,1678,1679,1680,1681,
1682,1683,1684,1685,1686,1687,1688,1689,1690,1691,1692,1693,1694,1695,1696,1697,1698,
1699,1700,1701,1702,1703,1704,1707,1708,1709,1710,1711,1712,1713,1714,1715,1716,1717,
1718,1719,1720,1721,1722,1723,1724,1725,1727,1728,1729,1730,1731,1732,1733,1734,1735,
1736,1737,1738,1739,1740,1741,1742,1743,1744,1745,1746,1747,1748,1749,1750,1751,1752,
1753,1754,1755,1756,1757,1758,1759,1760,1761,1762,1763,1764,1765,1766,1767,1768,1769,
1770,1771,1772,1773,1774,1775,1776,1777,1778,1779,1780,1781,1782,1783,1784,1785,1786,
1787,1788,1789,1790,1791,1792,1793,1794,1795,1796,1797,1798,1799,1800,1801,1802,1803,
1804,1805,1806,1807,1809,1810,1811,1812,1813,1814,1815,1816,1817,1818,1819,1820,1821,
1822,1823,1824,1825,1826,1827,1828,1829,1830,1831,1832,1833,1834,1835,1836,1837,1838,
1839,1840,1841,1842,1843,1844,1845,1846,1847,1848,1849,1850,1851,1852,1853,1855,1856,
1857,1858,1859,1860,1861,1862,1863,1864,1865,1866,1867,1868,1869,1870,1871,1872,1873,
1874,1875,1876,1877,1878,1879,1880,1881,1882,1883,1885,1886,1887,1888,1889,1890,1891,
1892,1893,1894,1895,1896,1897,1898,1899,1900,1901,1902,1903,1904,1905,1906,1907,1908,
1909,1910,1911,1912,1913,1914,1915,1916,1917,1918,1919,1920,1921,1922,1923,1924,1925,
1926,1927,1928,1929,1930,1931,1932,1933,1934,1935,1936,1938,1939,1940,1941,1942,1943,
1945,1946,1947,1948,1949,1950,1951,1952,1953,1954,1955,1956,1957,1958,1959,1960,1961,
1962,1963,1964,1965,1966,1967,1968,1969,1970,1971,1972,1973,1974,1975,1976,1977,1978,
1979,1980,1981,1982,1983,1984,1985,1986,1987,1988,1989,1990,1991,1992,1993,1994,1995,
1996,1997,1998,1999,2000,2001,2002,2003,2004,2005,2006,2007,2008,2009,2010,2011,2012,
2013,2014,2015,2016,2017,2018,2019,2020,2021,2022,2023,2024,2025,2026,2027,2028,2029,
2030,2031,2032,2033,2034,2035,2036,2037,2038,2039,2040,2041,2042,2043,2044,2045,2046,
2047,2048,2049,2050,2051,2052,2053,2054,2055,2056,2057,2058,2059,2060,2061,2062,2063,
2064,2065,2066,2067,2068,2069,2070,2071,2072,2073,2074,2075,2076,2079,2080,2081,2082,
2083,2084,2085,2086,2087,2088,2089,2090,2091,2092,2093,2094,2095,2096,2097,2098,2099,
2100,2101,2102,2103,2104,2106,2107,2108,2109,2110,2111,2112,2113,2114,2115,2116,2117,
2118,2119,2120,2121,2122,2123,2124,2125,2126,2127,2128,2129,2130,2131,2132,2133,2134,
2135,2136,2137,2138,2139,2140,2141,2142,2143,2144,2145,2146,2147,2148,2149,2150,2151,
2152,2153,2154,2155,2156,2157,2158,2159,2160,2161,2162,2163,2164,2165,2166,2167,2168,
2169,2170,2171,2172,2173,2174,2175,2176,2177,2178,2179,2180,2181,2182,2183,2184,2185,
2186,2187,2188,2189,2190,2191,2192,2193,2194,2195,2196,2197,2198,2199,2200,2201,2202,
2203,2204,2205,2206,2207,2208,2209,2210,2211,2212,2213,2214,2215,2216,2217,2218,2219,
2221,2222,2223,2224,2225,2227,2228,2229,2230,2231,2232,2290,2291,2292,2293,2294,2295,2296,2297,2298,2299,2300,2301,2302,2303,
2304,2305,2306,2307,2308,2309,2310,2311,2312,2313,2314,2315,2316,2317,2318,2319,2320,
2321,2322,2323,2324,2325,2326,2327,2328,2329,2330,2331,2332,2333,2334,2335,2336,2338,
2339,2340,2341,2342,2343,2344,2345,2346,2347,2348,2349,2350,2351,2352,2353,2354,2355,
2356,2359,2360,2361,2362,2363,2364,2365,2366,2367,2368,2370,2374,2375,2383,2384,2385,
2386,2387,2388,2389,2390,2391,2392,2393,2394,2396,2397,2398,2399,2400,2401,2402,2403,
2404,2405,2406,2407,2408,2409,2410,2412,2413,2414,2415,2416,2417,2418,2419,2420,2421,
2422,2423,2424,2425,2426,2427,2428,2429,2430,2431,2432,2433,2434,2435,2436,2438,2439,
2440,2441,2442,2443,2445,2446,2449,2450,2451,2452,2453,2454,2455,2456,2457,2458,2459,
2460,2461,2462,2463,2464,2465,2466,2467,2468,2469,2470,2471,2472,2473,2474,2475,2476,
2477,2478,2479,2480,2481,2482,2483,2484,2485,2487,2488,2489,2490,2491,2493,2494,2495,
2496,2497,2499,2500,2501,2502,2503,2504,2505,2506,2507,2508,2509,2510,2512,2513,2515,
2516,2517,2518,2520,2521,2522,2523,2524,2525,2526,2527,2528,2529,2530,2531,2532,2533,
2534,2535,2536,2537,2538,2539,2540,2541,2542,2543,2544,2545,2546,2547,2548,2550,2551,
2552,2553,2554,2555,2556,2557,2558,2559,2560,2561,2562,2563,2564,2565,2566,2567,2568,
2570,2571,2572,2573,2574,2575,2576,2577,2578,2579,2580,2581,2582,2583,2584,2585,2586,
2587,2588,2589,2590,2591,2592,2593,2594,2595,2596,2597,2598,2599,2600,2601,2602,2603,
2604,2605,2606,2607,2608,2609,2610,2611,2613,2615,2616,2617,2618,2619,2620,2621,2622,
2623,2625,2626,2628,2629,2630,2631,2632,2633,2634,2635,2636,2637,2638,2639,2640,2641,
2642,2643,2644,2645,2650};

#if (!WEB_CONFIG && !VERSION_MUSHAN)
#define IS_EQUAL(str,buff)	(strcmp(str,buff) == 0)
typedef enum {
	NOWTIME = 0,
	BRIGHTNESS,
	CITY,
	TEMP,
	ALARMDAY,
	CLOCK1,
	SLEEP1,	
	TIME1,
	REPEAT1,
	CLOCK2,
	SLEEP2,	
	TIME2,
	REPEAT2,
	CLOCK3,
	SLEEP3,	
	TIME3,
	REPEAT3,
	CONFIG_PARAM,
	CLOSE,
	PLUG,
	MAX_INDEX = 255,
}CONFIG_TYPE;

const char* configList[] = {"nowtime","brightness","city","temp","alarmday","clock1","sleep1","time1","repeat1","clock2","sleep2","time2","repeat2","clock3","sleep3","time3","repeat3","flash_param","close","plug"};
enum {
	MONDAY 		= 1 << 0,
	TUESDAY 	= 1 << 1,
	WEDNESDAY	= 1 << 2,
	THURSDAY	= 1 << 3,
	FRIDAY		= 1 << 4,
	SATURDAY	= 1 << 5,
	SUNDAY		= 1 << 6,
};

typedef struct {
	char nowtime;
	char brightness;
	char temp;
	unsigned int city;
	
	char sleep1;
	char sleep2;
	char sleep3;

	char alarm1;
	char alarm2;
	char alarm3;
	alarm_param alm_param[ALARM_NUM];
}t_config_param;
app_config_param appCfgPrm;

static t_config_param configParam;
static void init_socket_param()
{
	char loop = 0;
	memset(&(appCfgPrm.skPam.cltAddr),0,sizeof(struct sockaddr_in));
	memset(&(appCfgPrm.skPam.srvAddr),0,sizeof(struct sockaddr_in));
	for (loop = 0; loop < 10;loop++) {
		appCfgPrm.skPam.clientMsg.clientFd[loop] = -1;
	}
	appCfgPrm.skPam.clientMsg.clientFdIndex = 0;
}

char start_up()
{
	int ret = -1;
	
	appCfgPrm.skPam.srvFd = socket(AF_INET,SOCK_STREAM,IPPROTO_TCP);
	if(appCfgPrm.skPam.srvFd< 0){
		return -1;	
	}
	appCfgPrm.skPam.srvAddr.sin_port = htons(appCfgPrm.skPam.srvPort);
	appCfgPrm.skPam.srvAddr.sin_family = AF_INET;
	appCfgPrm.skPam.srvAddr.sin_addr.s_addr = htonl(INADDR_ANY);

	ret = bind(appCfgPrm.skPam.srvFd,(struct sockaddr* )&(appCfgPrm.skPam.srvAddr),sizeof(struct sockaddr_in));
	if (ret < 0) {
		return -1;
	}		
	ret = listen(appCfgPrm.skPam.srvFd,4);
	if (ret < 0) {
		return -1;
	}
	return 1;
}

char*
get_post_item(const char* postData,const char* item)
{
    int len = 0;
    char* addr;
    static char str[50];
    addr = (char*)strstr(postData,item);

    if(addr == NULL){
        return NULL;
    }
    addr += strlen(item) + 1;

    for(len;*(addr + len) != '&';len++)
        ;
    memset(str,0,sizeof(str));
    memcpy(str,addr,len);
    return (char* )str;
}

CONFIG_TYPE
get_config_index(const char* buff,char** indexBuff)
{
	unsigned char loop = 0;
	for (;loop < sizeof(configList);loop++) {
		*indexBuff = get_post_item(buff,configList[loop]);
		if (*indexBuff != NULL) {
//			printf("\r\n %s \r\n ",*indexBuff);
			return (CONFIG_TYPE) (loop);
		}
	}
}	

void 
fillin_alarm_param(const char* buff,alarm_param* alm_param,
const char* clock,const char* repeat,const char* sleep,const char* time)
{
	unsigned char loop = 0;
	char dayIndex = 0;
	char getRepeat[10] = {0};
	char getTime[10] = {0};
	char getSleep[10] = {0};
	char* getClock = NULL;
	strcpy(getRepeat,get_post_item(buff,repeat));
	strcpy(getSleep,get_post_item(buff,sleep));
	strcpy(getTime,get_post_item(buff,time));
	getClock = get_post_item(buff,clock);
	if (getClock != NULL) {
//		printf("\r\ngetClock %s getRepeat %s,getSleep %s,getTime %s",getClock,getRepeat,getSleep,getTime);
		if (getRepeat != NULL && !IS_EQUAL("null",getRepeat)) {
			dayIndex = atoi(getRepeat);
//			printf("day index %d",dayIndex);
			for (loop = 0;loop < 7;loop++) {
				if (dayIndex & (1 << loop)) {
					if (IS_EQUAL("true",getClock)) {
						alm_param[loop * 3].isOpen = true;
					} else {
						alm_param[loop * 3].isOpen = false;
					}
					alm_param[loop * 3].isOpenSnooze = IS_EQUAL("true",getSleep);
					alm_param[loop * 3].alarmTime = atoi(getTime);
					alm_param[loop * 3].defaultAlarmTime = atoi(getTime);	
					
				}
			}
		}								
	} 
}

void dump_config_param()
{
	unsigned char alarm_loop = 0;
	printf(" brightness %d, nowtime %d, temp %d, city %d \r\n",
			configParam.brightness,
			configParam.nowtime,
			configParam.temp,
			configParam.city);
	for (;alarm_loop < 21;alarm_loop++) {
	serial_printf(" alram default time: day:%d,default:%d,alarm:%d,snooze:%d,snooze open %d,isopen:%d\n",
					configParam.alm_param[alarm_loop].alarmDay,
					configParam.alm_param[alarm_loop].defaultAlarmTime,
					configParam.alm_param[alarm_loop].alarmTime,
					configParam.alm_param[alarm_loop].snoozeDelay,
					configParam.alm_param[alarm_loop].isOpenSnooze,
					configParam.alm_param[alarm_loop].isOpen);	
		}
}

static void inline plug_switch(unsigned char sw)
{
#define PLUG_SWITCH_PIN 9	
	gpio_enable(PLUG_SWITCH_PIN,1);
	pin_mode(PLUG_SWITCH_PIN,GPIO_OUT);	
	if (sw == true) {
		digital_write(PLUG_SWITCH_PIN,1);
	} else {
		digital_write(PLUG_SWITCH_PIN,0);
	}
}

void parse_get_data(const char* buff,t_config_param* configParam)
{
	unsigned int loop = 0;
	char cityNum[10] = {0};
	CONFIG_TYPE index = MAX_INDEX;
	char* indexBuff = NULL;
	index = get_config_index(buff,&indexBuff);
	switch (index) {
		case BRIGHTNESS:
			configParam->brightness = (char) ((*indexBuff) - '0') - 1;
			break;
		case NOWTIME:
			configParam->nowtime = (strcmp(indexBuff,"on") == 0);
			break;
		case TEMP:
			configParam->temp = (*indexBuff == 'C');
			break;
		case CITY:
			
			configParam->city = cityIdTable[0];
			for (loop = 0;loop < 2475;loop++) {
				if (strncmp(indexBuff,cityTable[loop],strlen(cityTable[loop])) == 0) {
					configParam->city = cityIdTable[loop];
				}
			}
			
			break;
		case CLOCK1:
			fillin_alarm_param(buff,&configParam->alm_param[0],configList[CLOCK1],
								configList[REPEAT1],configList[SLEEP1],configList[TIME1]);
			fillin_alarm_param(buff,&configParam->alm_param[1],configList[CLOCK2],
								configList[REPEAT2],configList[SLEEP2],configList[TIME2]);
			fillin_alarm_param(buff,&configParam->alm_param[2],configList[CLOCK3],
								configList[REPEAT3],configList[SLEEP3],configList[TIME3]);
			break;
		case CLOCK2:
			fillin_alarm_param(buff,&configParam->alm_param[1],configList[CLOCK2],
								configList[REPEAT2],configList[SLEEP2],configList[TIME2]);
			fillin_alarm_param(buff,&configParam->alm_param[2],configList[CLOCK3],
								configList[REPEAT3],configList[SLEEP3],configList[TIME3]);
			break;
		case CLOCK3:
			fillin_alarm_param(buff,&configParam->alm_param[2],configList[CLOCK3],
								configList[REPEAT3],configList[SLEEP3],configList[TIME3]);
			break;
		case CONFIG_PARAM:
			
			sdkParam.nt_param.isOpen = configParam->nowtime;
			//sdkParam.timeFmt_param.fmt = 
			sdkParam.wth_parma.cityId = configParam->city;
			sdkParam.temperature = configParam->temp;
			sdkParam.brightness = configParam->brightness;
			memcpy(sdkParam.alm_param,configParam->alm_param,ALARM_NUM * sizeof(alarm_param));
			
			config_set(&sdkParam);
			config_submit();	
			config_dump();
			reboot(1);
			
			break;
		case CLOSE:
			appCfgPrm.skPam.clientMsg.clientFdIndex -= 1;
			close(appCfgPrm.skPam.clientMsg.clientFd[appCfgPrm.skPam.clientMsg.clientFdIndex]);
			appCfgPrm.skPam.clientMsg.clientFd[appCfgPrm.skPam.clientMsg.clientFdIndex] = -1;
			break;
		case PLUG:
			plug_switch((strcmp(indexBuff,"on") == 0));
			break;
		default:
			break;
	}

}

void
handle_data(char* buff,int len)
{
	printf("%s \r\n",buff);
#if (WIFI_PLUG_DEMO == 0)
	parse_get_data(buff,&configParam);
//	dump_config_param();
#else
	if (strncmp(" plug=",buff,5) == 0) {
		printf("xxxxx");
		if (strncmp("on",(buff + 6),2) == 0) {
			printf("ON");
			plug_switch(true);
		} else {
			printf("OFF");
			plug_switch(false);
		}
	}
#endif
}

void receive_data()
{
	char i = 0;
	char ret = -1;
	char retry = 0;
	unsigned char revBuff[512];
	fd_set fdSet;
	struct timeval tv;
	tv.tv_sec = 1;
	tv.tv_usec = 0;
	memset(revBuff,0,sizeof(revBuff));
	
	while(1){
		//http_client_select(&fdSet,&appCfgPrm.skPam.clientMsg,handle_data);
		
		FD_ZERO(&fdSet);
		for (i = 0;i < MAX_SERVER_NUM;i++) {
			if (appCfgPrm.skPam.clientMsg.clientFd[i] == -1) {
				sys_msleep(100 * 1);
				continue;
			} else {
				FD_SET(appCfgPrm.skPam.clientMsg.clientFd[i],&fdSet);
				ret = select(appCfgPrm.skPam.clientMsg.clientFd[i] + 1,&fdSet,NULL,NULL,&tv);
				if (ret > 0) {
					memset(revBuff,0,512);
					ret = read(appCfgPrm.skPam.clientMsg.clientFd[i],&revBuff,sizeof(revBuff));	
					//printf("receive data is %s",revBuff);
					if (strcmp(revBuff,"reboot") == 0) {
//						debug("\r\n========starting ota update===========\r\n");
						send_event(REBOOT_EVENT);
					}
					handle_data(revBuff,ret);
				} else {
					;
					//printf("select fail \r\n");
				}
			}
		}
		
	}	
}
void dump_client_message()
{
	printf("clientPort is %d,clientd IP is %s",
			ntohs(appCfgPrm.skPam.cltAddr.sin_port),
			inet_ntoa(appCfgPrm.skPam.cltAddr.sin_addr)
			);
}

static char app_server_select()
{
	char ret = -1;
	fd_set fdSet;
	struct timeval tv;
	FD_ZERO(&fdSet);
	tv.tv_sec = 1;
	tv.tv_usec = 0;
	FD_SET(appCfgPrm.skPam.srvFd,&fdSet);

	ret = select(appCfgPrm.skPam.srvFd + 1,&fdSet,NULL,NULL,&tv);
	if(ret < 0){
		printf("\r\n===========socket server select failed=================\r\n");
		return -1;
	}
	if(FD_ISSET(appCfgPrm.skPam.srvFd,&fdSet)){
		return 1;	
	}else{
		return -1;
	}
}
static inline void app_accept()
{ 
	//selet polling
	char ret = -1;
	ret = app_server_select();
	if(ret > 0){
		if(appCfgPrm.skPam.clientMsg.clientFdIndex > 5){
//			assert("\r\n========client number overflow=======\r\n");
			return;
		}
		appCfgPrm.skPam.clientMsg.clientFd[appCfgPrm.skPam.clientMsg.clientFdIndex++] = accept(appCfgPrm.skPam.srvFd,(struct sockaddr* )&(appCfgPrm.skPam.cltAddr),&appCfgPrm.skPam.skaddrLen);
		if(appCfgPrm.skPam.clientMsg.clientFd[appCfgPrm.skPam.clientMsg.clientFdIndex -1] < 0){
			printf("======get clientfd fail==========================\n");
		}else{
			dump_client_message();
		}
	}
}
char create_socket_server()
{
	int ret = -1;
	init_socket_param();
	
	ret = start_up();
	if(ret < 0){
		printf("\r\n===========start up fail=================\r\n");
	}
	xTaskCreate(receive_data,"socketServerData",1024 * 4,0,5,0);
	return ret;
}

inline void init_config_param()
{
	memcpy(configParam.alm_param,sdkParam.alm_param,ALARM_NUM * sizeof(alarm_param));
	configParam.brightness = sdkParam.brightness;
	configParam.city = sdkParam.wth_parma.cityId;
	configParam.nowtime = sdkParam.nt_param.isOpen;
	configParam.temp = sdkParam.temperature;
	
	
}
void config_param()
{
	printf("\r\n=========starting config param============\r\n");
	appCfgPrm.skPam.skaddrLen = sizeof(struct sockaddr_in);
	appCfgPrm.skPam.srvPort = 80;
	create_socket_server();
	config_load();
	config_get(&sdkParam);
	init_config_param();
	while(1) {
		app_accept();
	}
}
#endif
#endif

