var expanded = false;
    function showCheckboxes(id) {
    var checkboxes = document.getElementById(id);
        if (!expanded) {
            checkboxes.style.display = "inline-block";
            expanded = true;
        } else {
            checkboxes.style.display = "none";
            expanded = false;
        }
    }
    function fillinCity() {
        var cityArray=["北京","天津","上海","重庆","河北省","内蒙古自治区","辽宁省","吉林省","黑龙江省","江苏省","浙江省","安徽省","福建省","江西省","山东省","河南省","湖北省","湖南省","广东省", "广西壮族自治区","海南省", "四川省","贵州省","云南省" , "西藏自治区", "陕西省","甘肃省","青海省","宁夏回族自治区", "新疆维吾尔自治区","台湾省" ];
        var country=document.getElementById("country");
        var city=document.getElementById("city");    

        for (var i=0; i<cityArray.length;i++){
            var temp  = new Option(cityArray[i],cityArray[i]);
            city[i] = temp;
        }
        city.options[0].selected =true;
        // console.log(city.selectedIndex);
    }

    function fillinDowntown() { 
        var downtownArray=[ ["东城区","西城区","宣武区","崇文区","丰台区","海淀区","朝阳区","石景山区","房山","平谷","密云","怀柔","延庆","大兴","门头沟","顺义","昌平"] , ["和平区","河东区","河西区","南开区","河北区","红桥区","塘沽区","汉沽区","大港区","东丽区","西青区","津南区","北辰区","武清区","宝坻区","宁河县","静海县","蓟县"] , ["黄浦区","卢湾区","徐汇区","长宁区","静安区","普陀区","闸北区","虹口区","杨浦区","浦东新区","宝山区","闵行区","嘉定区","金山区","松江区","青浦区","奉贤区","南汇区","崇明县"] , ["渝中区","沙坪坝区","北碚区","渝北区","涪陵区","江北区","南岸区","双桥区","万洲区","长寿区","大渡口区","九龙坡区","万盛区","巴南区","黔江区"] , ["石家庄市","唐山市","秦皇岛市","邯郸市","邢台市","保定市","张家口市","承德市","沧州市","廊坊市","衡水市","辛集市","藁城市","晋州市","新乐市","鹿泉市","遵化市","迁安市","武安市","南宫市","沙河市","涿州市","定州市","安国市","高碑店市","泊头市","任丘市","黄骅市","河间市","霸州市","三河市","冀州市","深州市"] , ["呼和浩特市","包头市","乌海市","赤峰市","通辽市","鄂尔多斯市","呼伦贝尔市","巴彦淖尔市","乌兰察布市","锡林郭勒盟","兴安盟","阿拉善盟","霍林郭勒市","满洲里市","牙克石市","扎兰屯市","根河市","额尔古纳市","丰镇市","锡林浩特市","二连浩特市","乌兰浩特市","阿尔山市"] , ["沈阳市","大连市","鞍山市","抚顺市","本溪市","丹东市","锦州市","营口市","阜新市","辽阳市","盘锦市","铁岭市","朝阳市","葫芦岛市","新民市","瓦房店市","普兰店市","庄河市","海城市","东港市","凤城市","凌海市","北镇市","大石桥市","盖州市","灯塔市","调兵山市","开原市","凌源市","北票市","兴城市"] , ["长春市","吉林市","四平市","辽源市","通化市","白山市","松原市","白城市","延边朝鲜族自治州","九台市","榆树市","德惠市","舒兰市","桦甸市","蛟河市","磐石市","公主岭市","双辽市","梅河口市","集安市","临江市","大安市","洮南市","延吉市","图们市","敦化市","龙井市","珲春市","和龙市"] , ["哈尔滨市","齐齐哈尔市","鹤岗市","双鸭山市","鸡西市","大庆市","伊春市","牡丹江市","佳木斯市","七台河市","黑河市","绥化市","大兴安岭地区","尚志市","双城市","五常市","讷河市","密山市","虎林市","铁力市","绥芬河市","宁安市","海林市","穆棱市","同江市","富锦市","北安市","五大连池市","安达市","肇东市","海伦市"] , ["南京市","无锡市","徐州市","常州市","苏州市","南通市","连云港市","淮安市","盐城市","扬州市","镇江市","泰州市","宿迁市","江阴市","宜兴市","邳州市","新沂市","金坛市","溧阳市","常熟市","张家港市","太仓市","昆山市","吴江市","如皋市","通州市","海门市","启东市","东台市","大丰市","高邮市","江都市","仪征市","丹阳市","扬中市","句容市","泰兴市","姜堰市","靖江市","兴化市"] , ["杭州市","宁波市","温州市","嘉兴市","湖州市","绍兴市","金华市","衢州市","舟山市","台州市","丽水市","建德市","富阳市","临安市","余姚市","慈溪市","奉化市","瑞安市","乐清市","海宁市","平湖市","桐乡市","诸暨市","上虞市","嵊州市","兰溪市","义乌市","东阳市","永康市","江山市","临海市","温岭市","龙泉市"] , ["合肥市","芜湖市","蚌埠市","淮南市","马鞍山市","淮北市","铜陵市","安庆市","黄山市","滁州市","阜阳市","宿州市","巢湖市","六安市","亳州市","池州市","宣城市","桐城市","天长市","明光市","界首市","宁国市"] , ["福州市","厦门市","莆田市","三明市","泉州市","漳州市","南平市","龙岩市","宁德市","福清市","长乐市","永安市","石狮市","晋江市","南安市","龙海市","邵武市","武夷山","建瓯市","漳平市","建阳市","福安市","福鼎市"] , ["南昌市","景德镇市","萍乡市","九江市","新余市","鹰潭市","赣州市","吉安市","宜春市","抚州市","上饶市","乐平市","瑞昌市","贵溪市","瑞金市","南康市","井冈山市","丰城市","樟树市","高安市","德兴市"] , ["济南市","青岛市","淄博市","枣庄市","东营市","烟台市","潍坊市","济宁市","泰安市","威海市","日照市","莱芜市","临沂市","德州市","聊城市","滨州市","菏泽市","章丘市","胶南市","胶州市","平度市","莱西市","即墨市","滕州市","龙口市","莱阳市","莱州市","招远市","蓬莱市","栖霞市","海阳市","青州市","诸城市","寿光市","安丘市","高密市","昌邑市","曲阜市","兖州市","邹城市","新泰市","肥城市","乳山市","文登市","荣成市","乐陵市","禹城市","临清市"] , ["郑州市","开封市","洛阳市","平顶山市","安阳市","鹤壁市","新乡市","焦作市","濮阳市","许昌市","漯河市","三门峡市","南阳市","商丘市","信阳市","周口市","驻马店市","巩义市","新郑市","新密市","登封市","荥阳市","中牟县","偃师市","汝州市","舞钢市","林州市","卫辉市","辉县市","沁阳市","孟州市","禹州市","长葛市","义马市","灵宝市","邓州市","永城市","项城市","济源市"] , ["武汉市","黄石市","十堰市","荆州市","宜昌市","襄樊市","鄂州市","荆门市","孝感市","黄冈市","咸宁市","随州市","恩施土家族苗族自治州","大冶市","丹江口市","洪湖市","石首市","松滋市","宜都市","当阳市","枝江市","老河口市","枣阳市","宜城市","钟祥市","应城市","安陆市","汉川市","麻城市","武穴市","赤壁市","广水市","仙桃市","天门市","潜江市","恩施市","利川市"] , ["长沙市","株洲市","湘潭市","衡阳市","邵阳市","岳阳市","常德市","张家界市","益阳市","郴州市","永州市","怀化市","娄底市","湘西土家族苗族自治州","浏阳市","醴陵市","湘乡市","韶山市","耒阳市","常宁市","武冈市","临湘市","汨罗市","津市市","沅江市","资兴市","洪江市","冷水江市","涟源市","吉首市"] , ["广州市","深圳市","珠海市","汕头市","韶关市","佛山市","江门市","湛江市","茂名市","肇庆市","惠州市","梅州市","汕尾市","河源市","阳江市","清远市","东莞市","中山市","潮州市","揭阳市","云浮市","从化市","增城市","乐昌市","南雄市","台山市","开平市","鹤山市","恩平市","廉江市","雷州市","吴川市","高州市","化州市","信宜市","高要市","四会市","兴宁市","陆丰市","阳春市","英德市","连州市","普宁市","罗定市"] , ["南宁市","柳州市","桂林市","梧州市","北海市","防城港市","钦州市","贵港市","玉林市","百色市","贺州市","河池市","来宾市","崇左市","岑溪市","东兴市","桂平市","北流市","宜州市","合山市","凭祥市"] , ["海口市","三亚市","文昌市","琼海市","万宁市","五指山市","东方市","儋州市"] , ["成都市","自贡市","攀枝花市","泸州市","德阳市","绵阳市","广元市","遂宁市","内江市","乐山市","南充市","眉山市","宜宾市","广安市","达州市","雅安市","巴中市","资阳市","阿坝藏族羌族自治州","甘孜藏族自治州","凉山彝族自治州","都江堰市","彭州市","邛崃市","崇州市","广汉市","什邡市","绵竹市","江油市","峨眉山市","阆中市","华蓥市","万源市","简阳市","西昌市"] , ["贵阳市","六盘水市","遵义市","安顺市","铜仁地区","毕节地区","黔西南布依族苗族自治州","黔东南苗族侗族自治州","黔南布依族苗族自治州","清镇市","赤水市","仁怀市","铜仁市","毕节市","兴义市","凯里市","都匀市","福泉市"] , ["昆明市","曲靖市","玉溪市","保山市","昭通市","丽江市","普洱市","临沧市","文山壮族苗族自治州","红河哈尼族彝族自治州","西双版纳傣族自治州","楚雄彝族自治州","大理白族自治州","德宏傣族景颇族自治州","怒江僳僳族自治州","迪庆藏族自治州","安宁市","宣威市","个旧市","开远市","景洪市","楚雄市","大理市","潞西市","瑞丽市"] , ["拉萨市","那曲地区","昌都地区","山南地区","日喀则地区","阿里地区","林芝地区","日喀则市"] , ["西安市","铜川市","宝鸡市","咸阳市","渭南市","延安市","汉中市","榆林市","安康市","商洛市","兴平市","韩城市","华阴市"] , ["兰州市","金昌市","白银市","天水市","嘉峪关市","武威市","张掖市","平凉市","酒泉市","庆阳市","定西市","陇南市","临夏回族自治州","甘南藏族自治州","玉门市","敦煌市","临夏市","合作市"] , ["西宁市","海东地区","海北藏族自治州","黄南藏族自治州","海南藏族自治州","果洛藏族自治州","玉树藏族自治州","海西蒙古族藏族自治州","德令哈市","格尔木市"] , ["银川市","石嘴山市","吴忠市","固原市","中卫市","灵武市","青铜峡市"] , ["乌鲁木齐市","克拉玛依市","吐鲁番地区","哈密地区","和田地区","阿克苏地区","喀什地区","塔城地区","阿勒泰地区","克孜勒苏柯尔克孜自治州","巴音郭楞蒙古自治州","昌吉回族自治州","博尔塔拉蒙古自治州","伊犁哈萨克自治州","石河子市","阿拉尔市","图木舒克市","五家渠市","吐鲁番市","哈密市","和田市","阿克苏市","喀什市","阿图什市","库尔勒市","昌吉市","阜康市","米泉市","博乐市","伊宁市","奎屯市","塔城市","乌苏市","阿勒泰市"] , ["台北市","高雄市","基隆市","台中市","台南市","新竹市","嘉义市","台北县","宜兰县","新竹县","桃园县","苗栗县","台中县","彰化县","南投县","嘉义县","云林县","台南县","高雄县","屏东县","台东县","花莲县","澎湖县"] ]
        var downtown=document.getElementById("downtown");
        var city=document.getElementById("city");
        console.log(city.selectedIndex);
        
        for (var i=0; i<downtownArray[city.selectedIndex].length;i++) {
            var temp  = new Option(downtownArray[city.selectedIndex][i],downtownArray[city.selectedIndex][i]);
            downtown[i] = temp;
        }
        downtown.options[0].selected=true
            
    }

    function ClAlarmTime() {
        //alert();
        var hour=document.getElementById("h1");
        var min=document.getElementById("m1");
        var sec=document.getElementById("s1");
        var totalSec=hour.selectedIndex*60*60+min.selectedIndex*60+sec.selectedIndex;
        hour.options[hour.selectedIndex].value=totalSec;

        hour=document.getElementById("h2");
        min=document.getElementById("m2");
        sec=document.getElementById("s2");
        totalSec=hour.selectedIndex*60*60+min.selectedIndex*60+sec.selectedIndex;
        hour.options[hour.selectedIndex].value=totalSec

        hour=document.getElementById("h3");
        min=document.getElementById("m3");
        sec=document.getElementById("s3");
        totalSec=hour.selectedIndex*60*60+min.selectedIndex*60+sec.selectedIndex;
        hour.options[hour.selectedIndex].value=totalSec
    }
    function fillinAlarmParam() {
        var h1=document.getElementById("h1");
        var m1=document.getElementById("m1");
        var s1=document.getElementById("s1");
        var h2=document.getElementById("h2");
        var m2=document.getElementById("m2");
        var s2=document.getElementById("s2");
        var h3=document.getElementById("h3");
        var m3=document.getElementById("m3");
        var s3=document.getElementById("s3");
        var i = 0;
        var temp = 0;
        for (i=0; i<24;i++){
            temp = new Option(i,i);
            h1[i] = temp;
        }  
        for (i=0; i<60;i++){
            temp  = new Option(i,i);
            m1[i] = temp;
        }
        for (i=0; i<60;i++){
            temp  = new Option(i,i);
            s1[i] = temp;
        } 

        for (i=0; i<24;i++){
            temp  = new Option(i,i);
            h2[i] = temp;
        }  
        for (i=0; i<60;i++){
            temp  = new Option(i,i);
            m2[i] = temp;
        }
        for (i=0; i<60;i++){
            temp  = new Option(i,i);
            s2[i] = temp;
        }

        for (i=0; i<24;i++){
            temp  = new Option(i,i);
            h3[i] = temp;
        }  
        for (i=0; i<60;i++){
            temp  = new Option(i,i);
            m3[i] = temp;
        }
        for (i=0; i<60;i++){
            temp  = new Option(i,i);
            s3[i] = temp;
        }     
    }
    function rCl(rpt) {
        var day=["1","2","3","4","5","6","7"];
        var rptIndex=[1 << 0,1 << 1,1 << 2,1 << 3,1 << 4,1 << 5,1 << 6];
        var rptValue = 0;
        for (var loop=0;loop < 7;loop++) {
            var id=document.getElementById(rpt+day[loop]);
            if (id.checked) {
                rptValue |= rptIndex[loop];
            }        
            if (!id.checked) {
                rptValue &= ~rptIndex[loop];
            }
        }
        var id=document.getElementById(rpt);
        id.value=rptValue;
        id.checked=true;
    }


    window.onload=function(){
        fillinAlarmParam();
        fillinCity();
        fillinDowntown();
    }
    // 


